Pank51591/STM32F103RC_DEMO/模块资料/IR/STM32_IR/User/main.c

// 基本定时器TIMx,x[6,7]定时应用
#include "stm32f10x.h"
#include "sys.h"
#include "bsp_led.h"
#include "bsp_TiMbase.h"
#include "bsp_IR.h"
#include "bsp_usart_dma.h"


volatile uint32_t time = 0; // ms 计时变量 

extern int Add_Data;
extern int Con_Data;

int main(void)
{
	Systick_Init();
	
	Infrared_Init();
	
	USART_Config();
	
	printf("初始化成功！开始监测红外！\r\n");
	
	while(1){
		if(Con_Data != 0){
			if(Con_Data == 162)printf("1\r\n");
			else if(Con_Data == 98)printf("2\r\n");
			else if(Con_Data == 226)printf("3\r\n");
			else if(Con_Data == 34)printf("4\r\n");
			else if(Con_Data == 2)printf("5\r\n");
			else if(Con_Data == 194)printf("6\r\n");
			else if(Con_Data == 224)printf("7\r\n");
			else if(Con_Data == 168)printf("8\r\n");
			else if(Con_Data == 144)printf("9\r\n");
			else if(Con_Data == 104)printf("*\r\n");
			else if(Con_Data == 152)printf("0\r\n");
			else if(Con_Data == 176)printf("#\r\n");
			else if(Con_Data == 24)printf("U\r\n");
			else if(Con_Data == 16)printf("L\r\n");
			else if(Con_Data == 56)printf("OK\r\n");
			else if(Con_Data == 90)printf("R\r\n");
			else if(Con_Data == 74)printf("D\r\n");
			Con_Data = 0;
		}
		
	}

}
/*********************************************END OF FILE**********************/

